#### Terraform Plan 📖
```module.layer.data.archive_file.layer_zip: Reading...
module.delete-failed-alarms.data.archive_file.delete-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.delete-failed-alarms.data.archive_file.delete-function-zip: Read complete after 0s [id=c19f74b80ab83af66f1f097ab40c61678e576d3e]
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=f77e090d05f04e46336d1f9f9ee0ac4ffa0c33d8]
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=ecd57e8c3d7f8f52ecb56f628f375e25cf1e600e]
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=df8cefdc6fee537082d19ea6512a57b8843d3a9f]
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=1012d83b1cdbb66c25d8325819341f48a8cca17a]
module.api.aws_api_gateway_api_key.api-key-dev: Refreshing state... [id=mtw89qlbs2]
module.alarm-trigger.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping: Refreshing state... [id=alarm.mythrowaway.net/]
module.api.aws_dynamodb_table.throwtrash-alarm-table: Refreshing state... [id=throwtrash-alarm]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.delete-failed-alarms.data.aws_region.current: Reading...
module.delete-failed-alarms.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.delete-failed-alarms.data.aws_caller_identity.current: Reading...
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group: Refreshing state... [id=throwtrash-alarm-schedule-group]
data.aws_region.current: Reading...
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api-gateway-prod-stage[0].aws_api_gateway_domain_name.api-domain-name: Refreshing state... [id=alarm.mythrowaway.net]
module.api.data.aws_region.current: Reading...
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm]
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.delete-failed-alarms.aws_cloudwatch_log_group.throwtrash-alarm-delete-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-delete-failed-alarms]
module.delete-failed-alarms.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue_deadletter: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue-deadletter]
module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-trigger]
module.api.data.aws_caller_identity.current: Reading...
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=ylt5sxzsod]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.delete-failed-alarms.aws_iam_role.throwtrash-alarm-delete-lambda-role: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role]
module.api-gateway-prod-stage[0].aws_route53_record.route53-record: Refreshing state... [id=Z5UYE2IX50J9A_alarm.mythrowaway.net_A]
module.api.aws_iam_role.throwtrash-alarm-scheduler-role: Refreshing state... [id=throwtrash-alarm-scheduler-role]
module.api.aws_iam_role.throwtrash-alarm-lambda-role: Refreshing state... [id=throwtrash-alarm-lambda-role]
module.api.aws_api_gateway_resource.api-resource-update: Refreshing state... [id=k5ktnr]
module.api.aws_api_gateway_resource.api-resource-create: Refreshing state... [id=wipuw0]
module.api.aws_api_gateway_resource.api-resource-delete: Refreshing state... [id=nkks0s]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue]
module.api.aws_api_gateway_method.api-method-put: Refreshing state... [id=agm-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_api_gateway_method.api-method-post: Refreshing state... [id=agm-ylt5sxzsod-wipuw0-POST]
module.api.aws_api_gateway_method.api-method-delete: Refreshing state... [id=agm-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_iam_policy.throwtrash-alarm-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-lambda-policy]
module.api-gateway-prod-stage[0].aws_api_gateway_deployment.api-deployment-prod: Refreshing state... [id=uuaip0]
module.api.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-lambda-role-20240429132809078300000002]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1: Refreshing state... [id=ags-ylt5sxzsod-v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v1: Refreshing state... [id=u56dai]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439018500000002]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1: Refreshing state... [id=terraform-20240502175438382900000001]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439070600000003]
module.layer.data.archive_file.layer_zip: Read complete after 4s [id=5358f96aaf8e30cc6a719437778712c954aed9b8]
module.layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29]
module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms]
module.api.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete]
module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda: Refreshing state... [id=throwtrash-alarm-trigger]
module.delete-failed-alarms.aws_iam_policy.throwtrash-alarm-delete-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-delete-failed-alarms-lambda-policy]
module.delete-failed-alarms.aws_lambda_event_source_mapping.sqs_event_source: Refreshing state... [id=4f0a182a-c8c3-4074-b237-de8d92a46774]
module.alarm-trigger.aws_lambda_function_event_invoke_config.throwtrash-alarm-trigger-lambda-event-invoke-config: Refreshing state... [id=throwtrash-alarm-trigger]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:dev]
module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0]: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod]
module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-scheduler-policy]
module.api.aws_lambda_function.throwtrash-alarm-create-lambda: Refreshing state... [id=throwtrash-alarm-create]
module.api.aws_lambda_function.throwtrash-alarm-update-lambda: Refreshing state... [id=throwtrash-alarm-update]
module.api.aws_api_gateway_integration.api-integration-delete: Refreshing state... [id=agi-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_lambda_alias.throwtrash-delete-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:dev]
module.delete-failed-alarms.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role-20250127153930440600000001]
module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role-20240429131751105100000002]
module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment: Refreshing state... [id=throwtrash-alarm-scheduler-role-20240429131751028900000001]
module.api.aws_lambda_permission.throwtrash-delete-permission-apigw: Refreshing state... [id=terraform-20240429131802029300000004]
module.api.aws_lambda_alias.throwtrash-update-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:dev]
module.api.aws_api_gateway_integration.api-integration-update: Refreshing state... [id=agi-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_lambda_alias.throwtrash-create-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:dev]
module.api.aws_api_gateway_integration.api-integration-create: Refreshing state... [id=agi-ylt5sxzsod-wipuw0-POST]
module.api.aws_lambda_permission.throwtrash-update-permission-apigw: Refreshing state... [id=terraform-20240429132827320000000006]
module.api.aws_lambda_permission.throwtrash-create-permission-apigw: Refreshing state... [id=terraform-20240429132817896500000004]
module.api.aws_api_gateway_deployment.api-deployment-dev: Refreshing state... [id=78em6t]
module.api.aws_api_gateway_stage.api-stage-dev: Refreshing state... [id=ags-ylt5sxzsod-dev]
module.api.aws_api_gateway_usage_plan.usage-plan-dev: Refreshing state... [id=4hwsh7]
module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev: Refreshing state... [id=mtw89qlbs2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0] will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-trigger-prod" {
      ~ function_version = "17" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod"
        name             = "prod"
        # (4 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
      ~ last_modified                  = "2025-01-27T15:39:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:17/invocations" -> (known after apply)
      ~ source_code_hash               = "OP17qLeYXcy9YDxwX9LuPffu5LWJx4gLDql0SqGDe+s=" -> "DaI0R/fM8SztXrq4tOp4fCwJ47E7ffeGuG6emFrnZf0="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "17" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "ALARM_TIME_INDEX_NAME"            = "alarm_time_index_v2"
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.api.aws_dynamodb_table.throwtrash-alarm-table will be updated in-place
  ~ resource "aws_dynamodb_table" "throwtrash-alarm-table" {
        id                          = "throwtrash-alarm"
        name                        = "throwtrash-alarm"
        tags                        = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
        # (12 unchanged attributes hidden)

      - global_secondary_index {
          - hash_key           = "alarm_time" -> null
          - name               = "alarm_time_index" -> null
          - non_key_attributes = [
              - "created_at",
              - "device_token",
              - "last_failed_time",
              - "last_successful_time",
              - "platform",
              - "user_id",
            ] -> null
          - projection_type    = "INCLUDE" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "alarm_time"
          + name               = "alarm_time_index"
          + non_key_attributes = [
              + "created_at",
              + "device_token",
              + "last_failed_time",
              + "last_successful_time",
              + "platform",
              + "user_id",
            ]
          + projection_type    = "INCLUDE"
          + read_capacity      = 0
          + write_capacity     = 0
        }
      + global_secondary_index {
          + hash_key           = "alarm_time"
          + name               = "alarm_time_index_v2"
          + non_key_attributes = [
              + "created_at",
              + "device_token",
              + "last_failed_time",
              + "last_successful_time",
              + "next_day_notification_enabled",
              + "platform",
              + "user_id",
            ]
          + projection_type    = "INCLUDE"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
        id                             = "throwtrash-alarm-create"
      ~ last_modified                  = "2025-01-27T15:43:51.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:16/invocations" -> (known after apply)
      ~ source_code_hash               = "6S1xCFflZAbYLK8IYaFAlSincX7488+f2r5u6GRGKX4=" -> "nvGMSPDzLsl8om4JCsffpwUNaL5A2r5Bv+3au4LlB/k="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "16" -> (known after apply)
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:17/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "17" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
        id                             = "throwtrash-alarm-update"
      ~ last_modified                  = "2025-01-27T15:43:51.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:16/invocations" -> (known after apply)
      ~ source_code_hash               = "MtD/zcN+J6rIs81CuJP+8WIYu/vUwcEsMM9LwpgntJU=" -> "lWI3vb3mdfovf3plTFzHhQe+sAG0S9j3D+19TONP81g="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "16" -> (known after apply)
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v2 will be created
  + resource "aws_api_gateway_api_key" "api-key-prod-v2" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "throwtrash-alarm-prod-key"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping will be destroyed
  # (because aws_api_gateway_base_path_mapping.api-base-path-mapping is not in configuration)
  - resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping" {
      - api_id         = "ylt5sxzsod" -> null
      - domain_name    = "alarm.mythrowaway.net" -> null
      - id             = "alarm.mythrowaway.net/" -> null
      - stage_name     = "v1" -> null
        # (2 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v1 will be created
  + resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v1" {
      + api_id      = "ylt5sxzsod"
      + domain_name = "alarm.mythrowaway.net"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v2 will be created
  + resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v2" {
      + api_id      = "ylt5sxzsod"
      + domain_name = "alarm.mythrowaway.net"
      + id          = (known after apply)
      + stage_name  = "v2"
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v2 will be created
  + resource "aws_api_gateway_stage" "api-stage-prod-v2" {
      + arn           = (known after apply)
      + deployment_id = "uuaip0"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "ylt5sxzsod"
      + stage_name    = "v2"
      + tags          = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all      = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + variables     = {
          + "stageName" = "v2"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v2 will be created
  + resource "aws_api_gateway_usage_plan" "usage-plan-prod-v2" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "throwtrash-alarm-prod-plan"
      + tags_all = (known after apply)

      + api_stages {
          + api_id = "ylt5sxzsod"
          + stage  = "v2"
        }
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v2 will be created
  + resource "aws_api_gateway_usage_plan_key" "api-plan-key-prod-v2" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2 will be created
  + resource "aws_lambda_alias" "throwtrash-create-alias-v2" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-create"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "v2"
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2 will be created
  + resource "aws_lambda_alias" "throwtrash-delete-alias-v2" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-delete"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "v2"
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2 will be created
  + resource "aws_lambda_alias" "throwtrash-update-alias-v2" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-update"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "v2"
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v2 will be created
  + resource "aws_lambda_permission" "throwtrash-create-permission-apigw-v2" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-create"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "v2"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/POST/create"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v2 will be created
  + resource "aws_lambda_permission" "throwtrash-delete-permission-apigw-v2" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-delete"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "v2"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/DELETE/delete"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v2 will be created
  + resource "aws_lambda_permission" "throwtrash-update-permission-apigw-v2" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-update"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "v2"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/PUT/update"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete-failed-alarms"
      ~ last_modified                  = "2025-01-27T15:38:53.458+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:1/invocations" -> (known after apply)
      ~ source_code_hash               = "Rw4Vmcwrn4qOHvwXsQTBnbNe6WulfJkVaAoYwSTt5Tc=" -> "14X049/S/pjVBOrwwDu+ygx1CEr8RydAtAMSz0YVO0o="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.layer.aws_lambda_layer_version.layer must be replaced
-/+ resource "aws_lambda_layer_version" "layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29" -> (known after apply)
      ~ code_sha256                 = "k/CVjjDvDTjRy9G6tpdIU8JbK2Uhb2szxWEVfpLKJBQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-01-27T15:38:52.898+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "k/CVjjDvDTjRy9G6tpdIU8JbK2Uhb2szxWEVfpLKJBQ=" -> "BY1ta3+R29VPsFA08ggXtr3/B6zAt/QRlkipEn5zDqc=" # forces replacement
      ~ source_code_size            = 38363289 -> (known after apply)
      ~ version                     = "29" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 13 to add, 7 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
stdout<<ghadelimiter_f699a095-1b82-42d2-b2ca-de886d59a835
module.layer.data.archive_file.layer_zip: Reading...
module.delete-failed-alarms.data.archive_file.delete-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.delete-failed-alarms.data.archive_file.delete-function-zip: Read complete after 0s [id=c19f74b80ab83af66f1f097ab40c61678e576d3e]
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=f77e090d05f04e46336d1f9f9ee0ac4ffa0c33d8]
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=ecd57e8c3d7f8f52ecb56f628f375e25cf1e600e]
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=df8cefdc6fee537082d19ea6512a57b8843d3a9f]
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=1012d83b1cdbb66c25d8325819341f48a8cca17a]
module.api.aws_api_gateway_api_key.api-key-dev: Refreshing state... [id=mtw89qlbs2]
module.alarm-trigger.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping: Refreshing state... [id=alarm.mythrowaway.net/]
module.api.aws_dynamodb_table.throwtrash-alarm-table: Refreshing state... [id=throwtrash-alarm]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.delete-failed-alarms.data.aws_region.current: Reading...
module.delete-failed-alarms.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.delete-failed-alarms.data.aws_caller_identity.current: Reading...
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group: Refreshing state... [id=throwtrash-alarm-schedule-group]
data.aws_region.current: Reading...
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api-gateway-prod-stage[0].aws_api_gateway_domain_name.api-domain-name: Refreshing state... [id=alarm.mythrowaway.net]
module.api.data.aws_region.current: Reading...
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm]
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.delete-failed-alarms.aws_cloudwatch_log_group.throwtrash-alarm-delete-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-delete-failed-alarms]
module.delete-failed-alarms.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue_deadletter: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue-deadletter]
module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-trigger]
module.api.data.aws_caller_identity.current: Reading...
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=ylt5sxzsod]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.delete-failed-alarms.aws_iam_role.throwtrash-alarm-delete-lambda-role: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role]
module.api-gateway-prod-stage[0].aws_route53_record.route53-record: Refreshing state... [id=Z5UYE2IX50J9A_alarm.mythrowaway.net_A]
module.api.aws_iam_role.throwtrash-alarm-scheduler-role: Refreshing state... [id=throwtrash-alarm-scheduler-role]
module.api.aws_iam_role.throwtrash-alarm-lambda-role: Refreshing state... [id=throwtrash-alarm-lambda-role]
module.api.aws_api_gateway_resource.api-resource-update: Refreshing state... [id=k5ktnr]
module.api.aws_api_gateway_resource.api-resource-create: Refreshing state... [id=wipuw0]
module.api.aws_api_gateway_resource.api-resource-delete: Refreshing state... [id=nkks0s]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue]
module.api.aws_api_gateway_method.api-method-put: Refreshing state... [id=agm-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_api_gateway_method.api-method-post: Refreshing state... [id=agm-ylt5sxzsod-wipuw0-POST]
module.api.aws_api_gateway_method.api-method-delete: Refreshing state... [id=agm-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_iam_policy.throwtrash-alarm-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-lambda-policy]
module.api-gateway-prod-stage[0].aws_api_gateway_deployment.api-deployment-prod: Refreshing state... [id=uuaip0]
module.api.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-lambda-role-20240429132809078300000002]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1: Refreshing state... [id=ags-ylt5sxzsod-v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v1: Refreshing state... [id=u56dai]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439018500000002]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1: Refreshing state... [id=terraform-20240502175438382900000001]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439070600000003]
module.layer.data.archive_file.layer_zip: Read complete after 4s [id=5358f96aaf8e30cc6a719437778712c954aed9b8]
module.layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29]
module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms]
module.api.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete]
module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda: Refreshing state... [id=throwtrash-alarm-trigger]
module.delete-failed-alarms.aws_iam_policy.throwtrash-alarm-delete-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-delete-failed-alarms-lambda-policy]
module.delete-failed-alarms.aws_lambda_event_source_mapping.sqs_event_source: Refreshing state... [id=4f0a182a-c8c3-4074-b237-de8d92a46774]
module.alarm-trigger.aws_lambda_function_event_invoke_config.throwtrash-alarm-trigger-lambda-event-invoke-config: Refreshing state... [id=throwtrash-alarm-trigger]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:dev]
module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0]: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod]
module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-scheduler-policy]
module.api.aws_lambda_function.throwtrash-alarm-create-lambda: Refreshing state... [id=throwtrash-alarm-create]
module.api.aws_lambda_function.throwtrash-alarm-update-lambda: Refreshing state... [id=throwtrash-alarm-update]
module.api.aws_api_gateway_integration.api-integration-delete: Refreshing state... [id=agi-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_lambda_alias.throwtrash-delete-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:dev]
module.delete-failed-alarms.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role-20250127153930440600000001]
module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role-20240429131751105100000002]
module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment: Refreshing state... [id=throwtrash-alarm-scheduler-role-20240429131751028900000001]
module.api.aws_lambda_permission.throwtrash-delete-permission-apigw: Refreshing state... [id=terraform-20240429131802029300000004]
module.api.aws_lambda_alias.throwtrash-update-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:dev]
module.api.aws_api_gateway_integration.api-integration-update: Refreshing state... [id=agi-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_lambda_alias.throwtrash-create-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:dev]
module.api.aws_api_gateway_integration.api-integration-create: Refreshing state... [id=agi-ylt5sxzsod-wipuw0-POST]
module.api.aws_lambda_permission.throwtrash-update-permission-apigw: Refreshing state... [id=terraform-20240429132827320000000006]
module.api.aws_lambda_permission.throwtrash-create-permission-apigw: Refreshing state... [id=terraform-20240429132817896500000004]
module.api.aws_api_gateway_deployment.api-deployment-dev: Refreshing state... [id=78em6t]
module.api.aws_api_gateway_stage.api-stage-dev: Refreshing state... [id=ags-ylt5sxzsod-dev]
module.api.aws_api_gateway_usage_plan.usage-plan-dev: Refreshing state... [id=4hwsh7]
module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev: Refreshing state... [id=mtw89qlbs2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0] will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-trigger-prod" {
      ~ function_version = "17" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod"
        name             = "prod"
        # (4 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
      ~ last_modified                  = "2025-01-27T15:39:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:17/invocations" -> (known after apply)
      ~ source_code_hash               = "OP17qLeYXcy9YDxwX9LuPffu5LWJx4gLDql0SqGDe+s=" -> "DaI0R/fM8SztXrq4tOp4fCwJ47E7ffeGuG6emFrnZf0="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "17" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "ALARM_TIME_INDEX_NAME"            = "alarm_time_index_v2"
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.api.aws_dynamodb_table.throwtrash-alarm-table will be updated in-place
  ~ resource "aws_dynamodb_table" "throwtrash-alarm-table" {
        id                          = "throwtrash-alarm"
        name                        = "throwtrash-alarm"
        tags                        = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
        # (12 unchanged attributes hidden)

      - global_secondary_index {
          - hash_key           = "alarm_time" -> null
          - name               = "alarm_time_index" -> null
          - non_key_attributes = [
              - "created_at",
              - "device_token",
              - "last_failed_time",
              - "last_successful_time",
              - "platform",
              - "user_id",
            ] -> null
          - projection_type    = "INCLUDE" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "alarm_time"
          + name               = "alarm_time_index"
          + non_key_attributes = [
              + "created_at",
              + "device_token",
              + "last_failed_time",
              + "last_successful_time",
              + "platform",
              + "user_id",
            ]
          + projection_type    = "INCLUDE"
          + read_capacity      = 0
          + write_capacity     = 0
        }
      + global_secondary_index {
          + hash_key           = "alarm_time"
          + name               = "alarm_time_index_v2"
          + non_key_attributes = [
              + "created_at",
              + "device_token",
              + "last_failed_time",
              + "last_successful_time",
              + "next_day_notification_enabled",
              + "platform",
              + "user_id",
            ]
          + projection_type    = "INCLUDE"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
        id                             = "throwtrash-alarm-create"
      ~ last_modified                  = "2025-01-27T15:43:51.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:16/invocations" -> (known after apply)
      ~ source_code_hash               = "6S1xCFflZAbYLK8IYaFAlSincX7488+f2r5u6GRGKX4=" -> "nvGMSPDzLsl8om4JCsffpwUNaL5A2r5Bv+3au4LlB/k="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "16" -> (known after apply)
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:17/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "17" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
        id                             = "throwtrash-alarm-update"
      ~ last_modified                  = "2025-01-27T15:43:51.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:16/invocations" -> (known after apply)
      ~ source_code_hash               = "MtD/zcN+J6rIs81CuJP+8WIYu/vUwcEsMM9LwpgntJU=" -> "lWI3vb3mdfovf3plTFzHhQe+sAG0S9j3D+19TONP81g="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "16" -> (known after apply)
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v2 will be created
  + resource "aws_api_gateway_api_key" "api-key-prod-v2" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "throwtrash-alarm-prod-key"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping will be destroyed
  # (because aws_api_gateway_base_path_mapping.api-base-path-mapping is not in configuration)
  - resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping" {
      - api_id         = "ylt5sxzsod" -> null
      - domain_name    = "alarm.mythrowaway.net" -> null
      - id             = "alarm.mythrowaway.net/" -> null
      - stage_name     = "v1" -> null
        # (2 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v1 will be created
  + resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v1" {
      + api_id      = "ylt5sxzsod"
      + domain_name = "alarm.mythrowaway.net"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v2 will be created
  + resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v2" {
      + api_id      = "ylt5sxzsod"
      + domain_name = "alarm.mythrowaway.net"
      + id          = (known after apply)
      + stage_name  = "v2"
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v2 will be created
  + resource "aws_api_gateway_stage" "api-stage-prod-v2" {
      + arn           = (known after apply)
      + deployment_id = "uuaip0"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "ylt5sxzsod"
      + stage_name    = "v2"
      + tags          = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all      = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + variables     = {
          + "stageName" = "v2"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v2 will be created
  + resource "aws_api_gateway_usage_plan" "usage-plan-prod-v2" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "throwtrash-alarm-prod-plan"
      + tags_all = (known after apply)

      + api_stages {
          + api_id = "ylt5sxzsod"
          + stage  = "v2"
        }
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v2 will be created
  + resource "aws_api_gateway_usage_plan_key" "api-plan-key-prod-v2" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2 will be created
  + resource "aws_lambda_alias" "throwtrash-create-alias-v2" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-create"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "v2"
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2 will be created
  + resource "aws_lambda_alias" "throwtrash-delete-alias-v2" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-delete"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "v2"
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2 will be created
  + resource "aws_lambda_alias" "throwtrash-update-alias-v2" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-update"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "v2"
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v2 will be created
  + resource "aws_lambda_permission" "throwtrash-create-permission-apigw-v2" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-create"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "v2"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/POST/create"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v2 will be created
  + resource "aws_lambda_permission" "throwtrash-delete-permission-apigw-v2" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-delete"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "v2"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/DELETE/delete"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v2 will be created
  + resource "aws_lambda_permission" "throwtrash-update-permission-apigw-v2" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-update"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "v2"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/PUT/update"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete-failed-alarms"
      ~ last_modified                  = "2025-01-27T15:38:53.458+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:1/invocations" -> (known after apply)
      ~ source_code_hash               = "Rw4Vmcwrn4qOHvwXsQTBnbNe6WulfJkVaAoYwSTt5Tc=" -> "14X049/S/pjVBOrwwDu+ygx1CEr8RydAtAMSz0YVO0o="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.layer.aws_lambda_layer_version.layer must be replaced
-/+ resource "aws_lambda_layer_version" "layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29" -> (known after apply)
      ~ code_sha256                 = "k/CVjjDvDTjRy9G6tpdIU8JbK2Uhb2szxWEVfpLKJBQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-01-27T15:38:52.898+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:29" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "k/CVjjDvDTjRy9G6tpdIU8JbK2Uhb2szxWEVfpLKJBQ=" -> "BY1ta3+R29VPsFA08ggXtr3/B6zAt/QRlkipEn5zDqc=" # forces replacement
      ~ source_code_size            = 38363289 -> (known after apply)
      ~ version                     = "29" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 13 to add, 7 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

ghadelimiter_f699a095-1b82-42d2-b2ca-de886d59a835
stderr<<ghadelimiter_ca265b76-c2eb-4027-813a-ff8a111708b7

ghadelimiter_ca265b76-c2eb-4027-813a-ff8a111708b7
exitcode<<ghadelimiter_946acef8-3a5b-457c-82c1-5f9537f31573
0
ghadelimiter_946acef8-3a5b-457c-82c1-5f9537f31573```